
#include <string>
#include "GPUParticles.h"
#include "Utility/stb_image.h"
#include "CFileC.h"
#include "Particles/Models/gpup_part_1024.h"
#include "Particles/Models/gpup_part_4096.h"
#include "wiRenderer.h"

// redefines MAX_PATH to 1050
#include "preprocessor-moreflags.h"

#ifdef OPTICK_ENABLE
#include "optick.h"
#endif

using namespace wiGraphics;
using namespace wiScene;

namespace GPUParticles
{

//void InitGPUParticlesTest();
//void GPUParticlesDrawTest( const CameraComponent& camera, CommandList cmd );

// file functions, only support one file open at a time
FILE* gpup_file = 0;
int GetFileExists( const char* filename ) 
{ 
	char fullPath[ MAX_PATH ];
	strcpy_s( fullPath, MAX_PATH, filename );
	GG_GetRealPath( fullPath, 0 );
	FILE *test = 0;
	int err = fopen_s( &test, fullPath, "rb" );
	if ( err == 0 )
	{
		fclose( test );
		return 1;
	}

	return 0; 
}

int OpenToRead( int fileID, const char* filename ) 
{ 
	char fullPath[ MAX_PATH ];
	strcpy_s( fullPath, MAX_PATH, filename );
	GG_GetRealPath( fullPath, 0 );
	int err = fopen_s( &gpup_file, fullPath, "rb" ); //PE: reading from docwrite failed here. (filename)
	if ( err == 0 ) return 1;
	else return 0;
}

void AGKDumpString( int fileID ) 
{  
	if ( !gpup_file ) return;

	char c;
	do
	{
		c = fgetc( gpup_file );
	} while( c != 0 && !feof(gpup_file) );
}

float AGKReadFloat( int fileID ) 
{ 
	if ( !gpup_file ) return 0;
	
	float f;
	fread( &f, 4, 1, gpup_file );
	return f;
}

int ReadInteger( int fileID ) 
{ 
	if ( !gpup_file ) return 0;

	int i = 0;
	fread( &i, 4, 1, gpup_file );
	return i;
}

void AGKCloseFile( int fileID ) 
{ 
	if ( !gpup_file ) return;
	fclose( gpup_file );
	gpup_file = 0;
}

int64_t i64StartTime = 0;
int64_t i64TimeFreq = 1;
void AGKTimerInit()
{
	QueryPerformanceCounter ( (LARGE_INTEGER*) &i64StartTime );
	QueryPerformanceFrequency ( (LARGE_INTEGER*) &i64TimeFreq );
	if ( i64TimeFreq == 0 ) i64TimeFreq = 1;
}

// Timer in seconds
float AGKTimer()
{
	int64_t i64CurrentTime;
	QueryPerformanceCounter ( (LARGE_INTEGER*) &i64CurrentTime );
	i64CurrentTime -= i64StartTime;
	return (float) (i64CurrentTime / (double) i64TimeFreq);
}

uint32_t iRandSeed = 0;
void RandomInit()
{
	int64_t i64CurrentTime;
	QueryPerformanceCounter ( (LARGE_INTEGER*) &i64CurrentTime );
	iRandSeed = (uint32_t) i64CurrentTime;
}

// produces a number between 0 and 65535
int Random() 
{ 
	// Uses integer overflow to generate pseudo random numbers.
	iRandSeed = (214013*iRandSeed + 2531011);
	// only use the top 16 bits as the lower 16 bits produce very short repeat cycles.
	return (iRandSeed >> 16) & 0xffff;
	return 0; 
}

int iRandMTIndex = 0;
uint32_t iRandMTArray[ 624 ];
void Random2Init()
{
	int64_t i64CurrentTime;
	QueryPerformanceCounter ( (LARGE_INTEGER*) &i64CurrentTime );

	iRandMTIndex = 0;
	iRandMTArray[0] = (uint32_t) i64CurrentTime;
	for ( int i = 1; i < 623; i++ )
	{
		iRandMTArray[i] = (1812433253 * (iRandMTArray[i-1] ^ (iRandMTArray[i-1] >> 30)) + i);
	}
}

// produces a number between -2,147,483,648 and 2,147,483,647
int Random2() 
{ 
	if ( iRandMTIndex == 0 ) 
	{
		for ( int i = 0; i < 624; i++ ) 
		{
			uint32_t y = (iRandMTArray[i] & 0x80000000) + (iRandMTArray[(i+1) % 624] & 0x7fffffff);
			iRandMTArray[i] = iRandMTArray[(i + 397) % 624] ^ (y>>1);
			if ( (y % 2) != 0 ) iRandMTArray[i] = iRandMTArray[i] ^ 0x9908b0df;
		}
	}

	uint32_t y = iRandMTArray[iRandMTIndex];
	y = y ^ (y >> 11);
	y = y ^ ((y << 7) & 0x9d2c5680);
	y = y ^ ((y << 15) & 0xefc60000);
	y = y ^ (y >> 18);

	iRandMTIndex = (iRandMTIndex + 1) % 624;
	return (int) y;
} 

//PE: Changed from 32 to 64.
#define gpup_maxeffects 64

#define gpup_particles_1k    32
#define gpup_particles_4k    64
#define gpup_particles_16k   128
#define gpup_particles_64k   256
#define gpup_particles_256k  512
#define gpup_particles_1M    1024

#define gpup_particles_opaque    1
#define gpup_particles_clipped   2
#define gpup_particles_alpha     3
#define gpup_particles_additive  4

#define gpup_active    1
#define gpup_inactive  0

// MainVS constants
struct sMainVSConstantData
{
	float4x4 World;
	float4x4 View;
	float4x4 Proj;
	float4x4 ViewProj;
	float4 globalpos[8];
	float4 tilex;
	float4 particles;
	float3 pgrow;
	float padding1;
	float3 ppos;
	float padding2;
	float3 area;
	float padding3;
	float3 rotat;
	float padding4;
	float3 rota;
	float padding5;
	float3 image_count;
	float padding6;
	float3 globalsize;
	float padding7;
	float3 globalrot;
	float padding8;
	float3 CameraPos;
	float padding9;
	float2 pcolor;
	float padding10;
	float padding11;
};

struct sMainPSConstantData
{
	float4 tile;
	float3 clr;
	float moder;
	float3 image_count;
	float agk_time;
	float opacity;
	float filler;  //PE: Must be 16 floats so, reserved for later.
	float filler2;
	float filler3;
};

struct sPosConstantData
{								// offset
	float4 gravity;				// 0
	float4 emittersize;			// 16
	float4 emitterrotation;		// 32
	float3 emitterline;			// 48
	float emittertype;			
	float3 emittersway;			// 64
	float agk_time;
	float3 localemitter;		// 80
	float warp;
	float3 pos1;				// 96
	float rnd;
	float3 pos2;				// 112
	float padding1;
	float3 emitterlinecount;	// 128
	float padding2;
	float3 moveit;				// 144
	float padding3;
	float3 particles;			// 160
	float padding4;
	float3 area;				// 176
	float padding5;
	float2 spawnpos;			// 192
	float2 lifespan;			// 200
};

struct sSpeedConstantData
{								// offset
	float4 area;				// 0
	float4 gravity;				// 16
	float4 speedvar;			// 32
	float4 field;				// 48
	float4 autorot;				// 64
	float4 reffloor;			// 80
	float4 refsphere;			// 96
	float3 particles;			// 112
	float rnd;					// 124
	float2 spawnpos;			// 128
	float warp;					// 136
	float rnd2;					// 140
};

struct sNoiseConstantData
{
	float3 off;
	float paddingsobuffermultipleofsixteen; // :)
};

sNoiseConstantData noiseConstantData;

class t_gpup_settings
{
public:
	int   simulOn = 0;
	float gtimer = 0;
	float time = 0;
	int   spawnCount = 0;
	int   pauser = 0;
	float tmr = 0;
	float sn = 0;
	float rotsn = 0;
		
	int   emitterCount = 0;
	int   lastEmitter = 0;
	int   activeEffects1 = 0;
	int   activeEffects2 = 0;
	int   activeEffects = 0;
			
	int   vrx = 0;
	int   vry = 0;
	int   split = 0;

	t_gpup_settings() {}
	~t_gpup_settings() {}
};

t_gpup_settings gpup_settings;

class t_gpup_emitter
{
public:
	std::string name;
	
	float x = 0;
	float y = 0;
	float z = 0;
	float scale = 0;
	int   particles = 0;
	float fsize = 0;
	int   frez = 0;
	int   ani_x = 0;
	int   ani_y = 0;
	int   ani_s = 0;
	
	int   effectVisible = 1;
	
	int   image_count = 0;	
	int   layer_count = 0;
	
	float area = 0;
	float varea = 0;
	float narea = 0;
	
	float r = 0;
	float g = 0;
